{
    "bikes": [
        {
            "id": "1",
            "bike_name": "Road",
            "bike_description": "Road bikes are designed to be ridden fast on smooth pavement. They have smooth, skinny tires and drop handlebars, and can be used for on-road racing. They are usually lighter than other types of bicycles. People find them uncomfortable and unstable on unpaved trails.",
            "bike_category": "Road",
            "bike_image": "https://www.bikeride.com/images/bike/Road-Bike-Chain-Reaction.jpg"
        },
        {
            "id": "2",
            "bike_name": "Cyclocross",
            "bike_description": "Cyclocross bikes are a special type of road bike designed to be raced on a mixed surface course (combination of pavement, unpaved trails, gravel, grass). They have a drop handlebar like regular road bikes, but the tires are a littler wider for more off-road traction, and they have a different style of brake that helps to prevent mud buildup in the frame.",
            "bike_category": "Road",
            "bike_image": "https://images.giant-bicycles.com/b_white,c_pad,h_650,q_80/spxknltjc4fqrijlkcy6/MY19-TCX-SLR-2_Color-A.jpg"
        },
        {
            "id": "3",
            "bike_name": "Touring",
            "bike_description": "Touring bikes are a special type of road bike. They are designed to be ridden on pavement. They have all of the necessary mounting bolts for cargo racks and fenders, and although they still have a drop handlebar, they usually have a more relaxed frame design so that the rider is more upright, for more comfort when riding long distances for multiple days at a time. They have a lower gear range compared to regular road bikes, to allow for carrying heavy loads up steep hills. They also make good commuter bikes, because of their durability and ability to carry heavy loads.",
            "bike_category": "Road",
            "bike_image": "https://vader-prod.s3.amazonaws.com/1551217303-kona-sutra-1551217296.jpg"
        },
        {
            "id": "4",
            "bike_name": "Triathlon/Time Trial",
            "bike_description": "Triathlon/time trial bikes are road bikes with a special design that maximizes their aerodynamic properties. The handlebars are also a special aerodynamic design that allows you to crouch forward while riding, to minimize the wind resistance against your body. Triathlon/time trial races usually have staggered starts, where each racer starts on his/her own; these bicycles are usually not allowed to be used in mass-start races.",
            "bike_category": "Road",
            "bike_image": "https://cdn.shopify.com/s/files/1/2318/5263/products/BTT10650_CM_01_800x800.jpg?v=1577057298"
        },
        {
            "id": "5",
            "bike_name": "Fitness",
            "bike_description": "Fitness bikes have most of the advantages of regular road bikes--lightweight frames and relatively narrow tires for efficiency on pavement--with a flat or upright handlebar. These bikes are designed for people who want a light, high-performance bike, but don't like the drop-handlebar riding position of a regular road bike. These bicycles are sometimes called flat-bar road bikes or performance hybrid bikes. Most of them can accept somewhat wider tires, to make them suitable for use on unpaved trails. They usually have the ability to mount cargo racks and fenders, which make them good commuter bikes.",
            "bike_category": "Hybrid",
            "bike_image": "https://trek.scene7.com/is/image/TrekBicycleProducts/FX1Disc_20_27987_A_Primary?$responsive-pjpg$&wid=1920&hei=1440"
        },
        {
            "id": "6",
            "bike_name": "Track/Fixed-Gear",
            "bike_description": "Track/fixed-gear bikes or fixies are designed to be ridden on a velodrome, which is a banked oval track specifically for bicycle racing. Some commuters prefer track bikes, however, due to their simple design, which makes them easy to maintain. They have a single gear that does not provide the ability to coast, so if the bike is moving, your feet must be pedaling. For even more simplicity, some riders prefer to not have brakes, since the fixed-gear mechanism can act as a brake. Most track bikes have drop handlebars, but some riders outfit theirs with flat or upright handlebars.",
            "bike_category": "Road",
            "bike_image": "https://cdn.shopify.com/s/files/1/0232/3305/products/State_Bicycle_Co_Undefeated_II_Track_Fixie_Black_Prism_1.jpg?v=1571266680"
        },
        {
            "id": "7",
            "bike_name": "Mountain",
            "bike_description": "Mountain bikes are design for riding rough off-road trails. They have flat or upright handlebars, and a very low gear range for pedaling up steep trails. Most mountain bikes have some type of shock absorbers or suspension. Mountain bikes with front suspension only are called hardtails; mountain bikes with both front and rear suspension are called full-suspension bikes or duallies. Mountain bikes with no suspension are called rigid. Mountain bikes can be outfitted for use as touring or commuting bikes, although they would not be as light or efficient as traditional touring or commuting bikes. Fat bikes, with their extremely wide tires, are included in the mountain bike category.",
            "bike_category": "Mountain",
            "bike_image": "https://static.evanscycles.com/production/bikes/mountain-bikes/product-image/969-638/trek-marlin-6-2020-mountain-bike-blue-EV369255-5000-1.jpg"
        },
        {
            "id": "8",
            "bike_name": "Hybrid",
            "bike_description": "Hybrid bikes were originally conceived to provide the advantages of both road bikes and mountain bikes. Their large, padded seats and upright handlebars provide a comfortable riding position, and are best for casual riding around the neighborhood or bike paths, short-distance commuting, and errands around town. They can be ridden on paved roads, but are not as lightweight or efficient as road bikes. They are ideal for paved or unpaved bike trails, but are not appropriate for rough off-road mountain bike trails. The tires are usually a medium-width with a semi-smooth tread, to provide a fairly smooth ride on pavement, but enough grip and cushion on unpaved trails. Most hybrid bikes have front suspension to smooth out small bumps, but some are fully rigid.",
            "bike_category": "Hybrid",
            "bike_image": "https://trek.scene7.com/is/image/TrekBicycleProducts/DualSport3_20_28839_A_Primary?$responsive-pjpg$&cache=on,on&wid=1920&hei=1440"
        },
        {
            "id": "9",
            "bike_name": "Cruiser",
            "bike_description": "Cruiser bikes are similar to hybrid bikes, in that they are designed for casual riding, and have a very comfortable, upright riding position, and a large, comfortable seat. Cruisers usually have wide \"balloon\" tires, and handlebars that are even more upright, and in some cases, swept back compared to hybrid bikes. Most cruiser bikes are single-speed or 3-speed, and have the old-fashioned coaster brake (where you pedal backwards to stop). They can be used for short-distance commuting and errands, as long as your route is fairly flat.",
            "bike_category": "Specialty",
            "bike_image": "https://trek.scene7.com/is/image/TrekBicycleProducts/CRUISERLUX3IMENS_19_17181_B_Primary?$responsive-pjpg$&wid=1920&hei=1440"
        },
        {
            "id": "10",
            "bike_name": "BMX",
            "bike_description": "BMX bikes are popular with kids because of their small size, but they are used by adults and kids alike for various styles of trick and stunt riding.",
            "bike_category": "Specialty",
            "bike_image": "https://cdn11.bigcommerce.com/s-44ck0/images/stencil/1280x1280/attribute_rule_images/1493_source_1544745060.jpg"
        },
        {
            "id": "11",
            "bike_name": "Folding",
            "bike_description": "Folding bikes are ideal for those who need to travel with their bike, want a bike to keep on their boat or plane, or who live in small apartments and don't have a lot of storage space. They're also good for commuters who need to take their bike on a bus or train for part of their commute, or who don't have a safe place to park their bike at work. Most folding bikes have smaller wheels, which makes the bike a little less efficient and trickier to handle than a standard bike.",
            "bike_category": "Specialty",
            "bike_image": "https://www.ternbicycles.com/sites/default/files/imagecache/wysiwyg_imageupload_colorbox_preset/users/uploads/42474/tn-byb_s11-pr.jpg"
        },
        {
            "id": "12",
            "bike_name": "Recumbent",
            "bike_description": "Recumbent bikes have a long, low design and a full-size seat with a backrest. Recumbents are available in two-wheel and three-wheel designs. Many recumbent riders feel that they are the most comfortable option available for bicycling. However, they are more difficult to pedal up hills, and they can be a challenge to carry from one place to another in a motor vehicle.",
            "bike_category": "Specialty",
            "bike_image": "https://www.performercycles.com/wp-content/uploads/2018/01/high-racer-recumbent-front-wheel-drive-folding-1024x683.jpg"
        },
        {
            "id": "13",
            "bike_name": "Tandem",
            "bike_description": "Tandem bikes are \"bicycles built for two.\" They come in all styles, from cruiser tandems and hybrid tandems for the bike path or boardwalk, off-road mountain bike tandems, and high-performance road racing tandems.",
            "bike_category": "Specialty",
            "bike_image": "https://static.evanscycles.com/production/bikes/tandems/product-image/969-638/ridgeback-velocity-2018-tandem-bike-grey-EV320438-7000-1.jpg"
        },
        {
            "id": "14",
            "bike_name": "Adult Tricycle",
            "bike_description": "Adult trikes are ideal for older folks who still want to get around under their own power, or those with balance issues or other special needs.",
            "bike_category": "Specialty",
            "bike_image": "https://www.utahtrikes.com/uploads/utupgradesproducts/11618204/bigpic/68312.jpg"
        }
    ],
    "parts": [
        {
            "id": "1",
            "part_name": "Pedal",
            "part_description": "This is the part that a cyclist places their feet on. The pedal is attached to the crank which is the component that the cyclist rotates to spin the chain which in turn provides the bicycle’s power.",
            "status": "Essential"
        },
        {
            "id": "2",
            "part_name": "Front derailleur",
            "part_description": "Mechanism for changing the front gears by lifting the chain from one chain wheel to another; it allows the cyclist to adapt to road conditions.",
            "status": "Essential"
        },
        {
            "id": "3",
            "part_name": "Chain (drive chain)",
            "part_description": "Set of metal links meshing with the sprockets on the chain wheel and gear wheel to transmit the pedaling motion to the rear wheel.",
            "status": "Essential"
        },
        {
            "id": "4",
            "part_name": "Chain stay",
            "part_description": "Tube connecting the pedal and crank mechanism to the rear-wheel hub.",
            "status": "Essential"
        },
        {
            "id": "5",
            "part_name": "Rear derailleur",
            "part_description": "Mechanism for changing the rear gears by lifting the chain from one gear wheel to another; it allows the cyclist to adapt to road conditions.",
            "status": "Essential"
        },
        {
            "id": "6",
            "part_name": "Rear brake",
            "part_description": "Mechanism activated by a brake cable, comprising a caliper and return springs; it forces a pair of brake pads against the sidewalls to stop the bicycle.",
            "status": "Essential"
        },
        {
            "id": "7",
            "part_name": "Seat tube",
            "part_description": "Part of the frame leaning slightly to the rear, receiving the seat post and joining the pedal mechanism.",
            "status": "Essential"
        },
        {
            "id": "8",
            "part_name": "Seat stay",
            "part_description": "Tube connecting the top of the seat tube with the rear-wheel hub.",
            "status": "Essential"
        },
        {
            "id": "9",
            "part_name": "Seat post",
            "part_description": "Component supporting and attaching the seat, inserted to variable depth into the seat tube to adjust the seat’s height.",
            "status": "Essential"
        },
        {
            "id": "10",
            "part_name": "Seat",
            "part_description": "Small triangular seat attached to the bicycle’s frame.",
            "status": "Essential"
        },
        {
            "id": "11",
            "part_name": "Crossbar",
            "part_description": "Horizontal part of the frame, connecting the head tube with the seat tube and stabilizing the frame.",
            "status": "Essential"
        },
        {
            "id": "12",
            "part_name": "Down tube",
            "part_description": "Part of the frame connecting the head tube to the pedal mechanism; it is the longest and thickest tube in the frame and gives it its rigidity.",
            "status": "Essential"
        },
        {
            "id": "13",
            "part_name": "Tire valve",
            "part_description": "Small clack valve sealing the inflation opening of the inner tube; it allows air to enter but prevents it from escaping.",
            "status": "Essential"
        },
        {
            "id": "14",
            "part_name": "Spoke",
            "part_description": "Thin metal spindle connecting the hub to the rim.",
            "status": "Essential"
        },
        {
            "id": "15",
            "part_name": "Tire",
            "part_description": "Structure made of cotton and steel fibers coated with rubber, mounted on the rim to form the casing for the inner tube.",
            "status": "Essential"
        },
        {
            "id": "16",
            "part_name": "Rim",
            "part_description": "Metal circle constituting the wheel’s circumference and on which the tire is mounted.",
            "status": "Essential"
        },
        {
            "id": "17",
            "part_name": "Hub",
            "part_description": "Central part of the wheel from which spokes radiate. Inside the hub are ball bearings enabling it to rotate around its axle.",
            "status": "Essential"
        },
        {
            "id": "18",
            "part_name": "Fork",
            "part_description": "Two tubes connected to the head tube and attached to each end of the front-wheel hub.",
            "status": "Essential"
        },
        {
            "id": "19",
            "part_name": "Front brake",
            "part_description": "Mechanism activated by a brake cable, comprising a caliper and return springs; it forces a pair of brake pads against the sidewalls to slow down the front wheel.",
            "status": "Essential"
        },
        {
            "id": "20",
            "part_name": "Brake lever",
            "part_description": "Lever attached to the handlebars for activating the brake caliper via a cable.",
            "status": "Essential"
        },
        {
            "id": "21",
            "part_name": "Head tube",
            "part_description": "Tube using ball bearings to transmit the steering movement to the fork.",
            "status": "Essential"
        },
        {
            "id": "22",
            "part_name": "Stem",
            "part_description": "Part whose height is adjustable; it is inserted into the head tube and supports the handlebars.",
            "status": "Essential"
        },
        {
            "id": "23",
            "part_name": "Handlebars",
            "part_description": "Device made up of two handles connected by a tube, for steering the bicycle.",
            "status": "Essential"
        },
        {
            "id": "24",
            "part_name": "Brake cable",
            "part_description": "Sheathed steel cable transmitting the pressure exerted on the brake lever to the brake.",
            "status": "Essential"
        },
        {
            "id": "25",
            "part_name": "Shifter",
            "part_description": "Lever for changing gears via a cable moving the derailleur.",
            "status": "Essential"
        },
        {
            "id": "26",
            "part_name": "Toe clip",
            "part_description": "This is a metal/plastic/leather device attached to the pedals that covers the front of the feet, keeping the feet in the proper position and increasing peddling power.",
            "status": "Optional"
        },
        {
            "id": "27",
            "part_name": "Reflector",
            "part_description": "Device returning light toward its source so that other users of the road might see the cyclist.",
            "status": "Optional"
        },
        {
            "id": "28",
            "part_name": "Fender",
            "part_description": "Piece of curved metal covering part of the wheel to protect the cyclist from being splashed by water.",
            "status": "Optional"
        },
        {
            "id": "29",
            "part_name": "Rear light",
            "part_description": "A red light that makes the cyclist visible in the dark.",
            "status": "Optional"
        },
        {
            "id": "30",
            "part_name": "Generator",
            "part_description": "Mechanism activated by the rear wheel, converting the wheel’s motion into electric energy to power the front and rear lights.",
            "status": "Optional"
        },
        {
            "id": "31",
            "part_name": "Carrier (rear rack)",
            "part_description": "Device attached to the back of the bicycle for carrying bags on each side and packages on top.",
            "status": "Optional"
        },
        {
            "id": "32",
            "part_name": "Tire pump",
            "part_description": "Device that compresses air and is used to inflate a bicycle tire’s inner tube.",
            "status": "Optional"
        },
        {
            "id": "33",
            "part_name": "Water bottle clip",
            "part_description": "Support attached to the down tube or the seat tube for carrying the water bottle.",
            "status": "Optional"
        },
        {
            "id": "34",
            "part_name": "Headlight",
            "part_description": "Lamp illuminating the ground a few yards in front of the bicycle.",
            "status": "Optional"
        }
    ]
}